/*
 * bsp.c
 *
 *  Created on: Mar 25, 2025
 *      Author: compro
 */
#include "bsp.h"

/*
*********************************************************************************************************
*   함수 이름: bsp_Init
*   함수 설명: 하드웨어 장치를 초기화합니다. 한 번만 호출하면 됩니다. 이 함수는 CPU 레지스터와 외부 장치 레지스터를 구성
            하고 일부 전역 변수를 초기화합니다.
*   파라미터: None
*   반환값: None
*********************************************************************************************************
*/
void bsp_Init(void)
{
    bsp_InitLed();      // LED 포트 초기화 함수
}
